import { SecondaryLayout } from "layouts/SecondaryLayout"
import { H3, Heading, Paragraph } from "ui"

export const Discord = () => {
    return (
        <SecondaryLayout>
            <section className="block-primary">

                <Heading title='DISCORD CЕРВЕР'>
                Краткое описание каналов в Дискорд
                </Heading>

                <H3>
                    Welcome
                </H3>
                <Paragraph>
                    <strong>🏁start-here</strong> - канал, в котором содержится краткая информация о каналах, ролях и поинтах на сервере ECO, а также полезные ссылки. Так же здесь становятся Layer 1
                </Paragraph>
                <Paragraph>
                    <strong>rules and faqs</strong> - правила сервера и ответы на самые популярные вопросы
                </Paragraph>
                <Paragraph>
                    <strong>📣announcements</strong> - все самые важные новости проекта публикуются здесь
                </Paragraph>
                <Paragraph>
                    <strong>📣minor-announcements</strong> - информация о еженедельных созвонах
                </Paragraph>
                <Paragraph>
                    <strong>official-linkand-contract-addresses</strong>  - ссылки на все официальные источники и адрес контрактов
                </Paragraph>
                <Paragraph>
                    <strong>🔈support</strong> - канал поддержки/технической помощи.
                </Paragraph>
                <Paragraph>
                    <strong>governance-and-monetary-policy-updates</strong> - инфрмация об актуальном голосовании/управлении и обновлении монетарной политики
                </Paragraph>
                <Paragraph>
                    <strong>⚠report-spam</strong> - канал в котором можно сообщить о спаме/вредоносной активности, связанной с ECO. Прикрепите в сообщение доказательство вредоносной активности(скрины из переписки и т.д.) и отметьте Dave | Eco#2900 или @Prefect
                </Paragraph>

                <H3>
                    Office hours
                </H3>
                <Paragraph><strong>office hours voice</strong> - голосовой канал для проведения рабочих созвонов с командой</Paragraph>

                <H3>
                    Monetary Policy Trustees
                </H3>
                <Paragraph><strong>trustee-candidate-introductions</strong> - в этом канале вы можете найти информацию про попечителей
                </Paragraph>
                <Paragraph><strong>trustee community</strong> - 'тот канал предназначен для связи между группой попечителей монетарной политики и широким сообществом.</Paragraph>




                <H3>
                    Layer 3
                </H3>
                <Paragraph><strong>l3-announsment</strong> - важные анонсы для Layer 3</Paragraph>
                <Paragraph><strong>l3-general</strong> - основной канал для общения Layer 3</Paragraph>
                <Paragraph><strong>l3-voting</strong> - канал для голосований</Paragraph>
                <Paragraph><strong>l3-season-activities</strong> - в данном разделе вы можете предложить на рассмотрение свою идею активности и получить обратную связь и поддержку от Layer 3 и команды</Paragraph>
                <Paragraph><strong>l3-feedback</strong> - канал для обратной связи по любому вопросу</Paragraph>
                <Paragraph><strong>l3-data</strong> - основной канал c данными</Paragraph>
                <Paragraph><strong>l3-voice</strong> - голосовой канал для Layer 3</Paragraph>




                <H3>
                    Layer 2
                </H3>
                <Paragraph><strong>litany-against-doubt</strong> - ежедневная мантра)</Paragraph>
                {/* <Paragraph><strong>ECO</strong></Paragraph> */}
                <Paragraph><strong>mutuail aid</strong> - Канал для добрых дел</Paragraph>
                <Paragraph><strong>💬speakeasy</strong> - Канал, в котором участники с ролью Layer 2 могут координировать свои действия по решению проблем и обсуждать темы, уникальные для этой роли.</Paragraph>
                <Paragraph><strong>happy-birthday</strong> - поделитесь датой своего ДР и получите поинты и поздравления</Paragraph>
                <Paragraph><strong>🃏Layer2 game</strong> - Канал, в котором проходят анонсы предстоящих игр для Л2</Paragraph>




                <H3>
                    Discussions
                </H3>
                <Paragraph><strong>🚀general </strong> - основное общение на английском, которое не подпадает под другие категории. Здесь вы можете вести общение со всеми участниками. Кроме того, здесь публикуется важная информация от префектов и членов команды ECO. Самые заметные и активные участники иногда получают поинты.</Paragraph>
                <Paragraph><strong>📈crypto-chat</strong> - Канал для обсуждения всего что относится к криптоиндустрии. Здесь публикуются различные статьи и новости о криптопроектах.</Paragraph>
                <Paragraph><strong>governance</strong> - в этом канале можете задать вопросы по управлению ЕСО</Paragraph>
                <Paragraph><strong>🧮eco-nomics</strong> - канал для общение об экономике ECO</Paragraph>
                <Paragraph><strong>introduce-yourself</strong> - в этом канале вы можете написать о сових навыках,найти подходящего кандидата для работы и тд</Paragraph>
                <Paragraph><strong>product-feedback</strong> - вы можете оставить обратную связь об продуктах ЕСО</Paragraph>
                <Paragraph><strong>🧪meme-lab</strong> - Канал, в котором публикуются качественные мемы, касающиеся проекта ECO</Paragraph>



                <H3>
                    Accountant Mechanics
                </H3>
                <Paragraph><strong>layer3-point-granting</strong> - в этом канале layer3 может запросить ранее согласованный грант</Paragraph>
                <Paragraph><strong>check-your-points</strong> - проверка баланса поинтов</Paragraph>
                <Paragraph><strong>eco-server-points-log</strong> - информация о движении поинтов</Paragraph>
                <Paragraph><strong>grants-log</strong> - информация о грантах</Paragraph>
                <Paragraph><strong>points-log</strong> - информация о поитах</Paragraph>



                <H3>
                    Built on ECO
                </H3>
                <Paragraph><strong>Eco App</strong> - этот канал предназначен для обсуждения одного из первых продуктов, созданных на основе системы Eco Currency — Eco App.</Paragraph>
                <Paragraph><strong>Eco Id</strong> - Этот канал предназначен для обсуждения одного из первых продуктов, созданных на основе (и поддерживающих) систему эковалюты — Eco ID.</Paragraph>
                <Paragraph><strong>dashboards and data</strong> - Этот канал предназначен для обсуждения информационных панелей и данных, созданных на основе протокола Eco — ECO и ECOx.</Paragraph>




                <H3>
                    Content & Bounties
                </H3>
                <Paragraph><strong>#ECO-CREATORS</strong> - Этот канал предназначен для создания концептуального и оригинального контента, сделанного сообществом, в разных форматах и на разные темы.</Paragraph>
                <Paragraph><strong>Eco-Art</strong> - задания на тему Art</Paragraph>
                <Paragraph><strong>🧩community-activities</strong> - Канал, в котором публикуются активные конкурсы и задания от участников ECO комьюнити.</Paragraph>
                <Paragraph><strong>Eco-Friendly</strong> - канал с полезными заданиями</Paragraph>
                <Paragraph><strong>🐶🐱eco-pets</strong> - Раздел с фотографиями ваших домашних животных. Фото с вашим питомцем должно содержать логотип ECO. </Paragraph>
                <Paragraph><strong>🏝weekends-and-holidays</strong> - Канал, где можно поделиться, как вы проводите свои выходные и(или) отпуск.</Paragraph>
                <Paragraph><strong>❤ eco-for-good</strong> - Канал, в котором можно выкладывать свои добрые дела( помощь уличным животным, людям, помогать пожилым, стать донором, волонтером, навести где то порядок(убрать мусор), купить цветы и раздать девушкам и т.д.). Данная активность поинтами не награждается!</Paragraph>
                <Paragraph><strong>yoga</strong> - онлайн занятие по йоге</Paragraph>
                <Paragraph><strong>mindful sundays</strong> - сессии медитации</Paragraph>
                <Paragraph><strong>🎧past-event-audio</strong> - Канал, в котором хранятся записи с АМА</Paragraph>
                <Paragraph><strong>healthy ecolytes</strong> - спортивные занятия</Paragraph>
                <Paragraph><strong>Eco metaverse</strong> - челенджи по игре sandbox </Paragraph>



                <H3>
                    ECO EDUCATION
                </H3>
                <Paragraph><strong>questions and registration</strong> - в этом канале вы можете задать вопрос по Академии и зарегистрироваться на любой курс обучения</Paragraph>
                <Paragraph><strong>dance class</strong> - танцевальный класс</Paragraph>
                <Paragraph><strong>Crypto literacy </strong> - обучение по крипте</Paragraph>
                <Paragraph><strong>Health class</strong> - обучение по здоровью</Paragraph>
                <Paragraph><strong>Chess </strong>- обучение шахматам</Paragraph>
                <Paragraph><strong>English beginners</strong> - обучение английский для новичков</Paragraph>
                <Paragraph><strong>English intermediate</strong>- обучение английский продвинутый уровень</Paragraph>

                <Paragraph><strong>art class</strong> - художественный класс</Paragraph>
                <Paragraph><strong>introduction to node</strong> - обучение нодам</Paragraph>
                <Paragraph><strong>photoshop</strong> - обучение по фотошопу</Paragraph>

                <H3>
                    Music
                </H3>
                <Paragraph><strong>💬ecomusic-creations</strong> - музыкальные каналы,обсуждение музыки</Paragraph>
                <Paragraph><strong>🎧music-controller</strong> - Канал для управления радио ECO FM</Paragraph>
                <Paragraph><strong>📻music-controller</strong> - здесь можно послушать разнообразную музыку в прямом эфире.  Начало эфира анонсируют @parallacs и @Dave | Eco</Paragraph>




                <H3>
                    Other languages
                </H3>

                <Paragraph><strong>🇷🇺ru-eco</strong> - основной канал для ру-сообщества, здесь осуществляется помощь новичкам, обсуждаются активности и новости проекта.</Paragraph>
                <Paragraph><strong>🌏other-languages</strong> - для всех остальных языков, поиск единомышленников</Paragraph>

            </section>
        </SecondaryLayout>
    )
}