import './News_2.scss'

export const News2 = () => {
    return (
        <section className="news2">
            <h3 className="news2__title">Что такое Eco?</h3>
            <div className="news2__content">
                <p className="news2__text">
                    ЕСО - это валюта с растущим сообществом, создающим продукты и услуги, способствующие ее развитию. Она разработана как децентрализованная альтернатива фиатным валютам, использующая денежную политику для развития и поддержки растущей экономики.
                </p>
                <p className="news2__text">
                Идея Eco основана на следующих предположениях: 
При наличии более качественных экономических данных и более прозрачной структуры стимулов для управления, можно управлять и развивать резервную валюту, которая является цифровой и более четко соответствует коллективным интересам ее пользователей (нас).
                </p>
                <p className="news2__text">
                Проще говоря: ЕСО - это денежная игра, в которой мы действительно можем выиграть - вместе.
                </p>
                <p className="news2__text">
                Эта страница содержит ссылки на ключевые ресурсы и ответы на часто задаваемые вопросы.
                </p>
                <ul className="news2__list">
                    <li className="news2__list-item">
                    Это один из первых крипто-проектов, которые максимально прячут использование крипты для конечного пользователя, без необходимости разбираться в приватных ключах, tx hash и прочей ненужной для пользователя технической информации;
                    </li>
                    <li className="news2__list-item">
                    В США рынок финтеха развит довольно слабо по сравнению с Европой, процент на остаток по карте (привычная в СНГ вещь) пока что там не распространена совсем, а ставки по депозитам в банках - околонулевые;
                        </li>
                        <li className="news2__list-item">
                        CEO - Энди Брумберг - ранее основал Coinlist и еще ряд успешных стартапов.
                        </li>
                </ul>
                <p className="news2__text">

                </p>
                <p className="news2__text">

                </p>

            </div>
        </section>
    )
}