import { H2, Paragraph } from 'ui'

import { JoinItem } from './components/JoinItem'

import './JoinUs.scss'

export const JoinUs = () => {
    return (
        <section className="join-us" id='join-us'>
            <div className="container">
                <H2>Присоеденяйся к нам!</H2>
                <Paragraph dark={true}>
                    Присоединяйся к нам в наших активных сообществах, чтобы быть в курсе последних новостей, участвовать в дискуссиях и быть первыми, кто узнает о наших важных анонсах.
                </Paragraph>

                <ul className="join-us__socials">

                    <JoinItem
                        title='Discord'
                        image={
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M34.9541 14.01C32.786 13.0575 30.4971 12.3817 28.146 12C27.8243 12.5519 27.5332 13.1197 27.2739 13.7011C24.7695 13.339 22.2226 13.339 19.7182 13.7011C19.4588 13.1198 19.1677 12.552 18.8461 12C16.4935 12.3849 14.2031 13.0623 12.0328 14.0149C7.72414 20.132 6.55613 26.0971 7.14014 31.9776C9.66338 33.7665 12.4876 35.127 15.49 36C16.1661 35.1275 16.7643 34.2018 17.2784 33.2329C16.302 32.883 15.3597 32.4512 14.4622 31.9427C14.6984 31.7783 14.9294 31.609 15.1526 31.4446C17.764 32.623 20.6142 33.234 23.4999 33.234C26.3857 33.234 29.2359 32.623 31.8473 31.4446C32.0731 31.6214 32.3041 31.7908 32.5377 31.9427C31.6385 32.4521 30.6944 32.8846 29.7163 33.2354C30.2297 34.2039 30.828 35.1287 31.5046 36C34.5097 35.1305 37.336 33.7707 39.8597 31.9801C40.545 25.1606 38.6891 19.2503 34.9541 14.01ZM18.0181 28.3611C16.3907 28.3611 15.0462 26.944 15.0462 25.2005C15.0462 23.457 16.344 22.0274 18.0129 22.0274C19.6819 22.0274 21.016 23.457 20.9874 25.2005C20.9589 26.944 19.6767 28.3611 18.0181 28.3611ZM28.9818 28.3611C27.3518 28.3611 26.0124 26.944 26.0124 25.2005C26.0124 23.457 27.3102 22.0274 28.9818 22.0274C30.6533 22.0274 31.977 23.457 31.9485 25.2005C31.9199 26.944 30.6403 28.3611 28.9818 28.3611Z" fill="var(--color-text)" />
                            </svg>

                        }
                        link='https://discord.eco.org/'>
                        Присоединяйся к нашему Discord-серверу, чтобы стать частью нашего растущего сообщества и обмениваться опытом с другими единомышленниками.
                    </JoinItem>

                    <JoinItem
                        title='Twitter'
                        image={
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M40.9983 13.3239C39.7249 13.8944 38.3745 14.2691 36.9919 14.4356C38.4493 13.5527 39.54 12.1633 40.0609 10.5262C38.6932 11.3506 37.1937 11.9284 35.6308 12.241C34.581 11.1033 33.1895 10.3487 31.6726 10.0947C30.1557 9.84061 28.5985 10.1013 27.243 10.8361C25.8875 11.571 24.8096 12.7388 24.177 14.1581C23.5444 15.5775 23.3924 17.1687 23.7448 18.6845C20.9711 18.5437 18.2577 17.8137 15.7807 16.5417C13.3037 15.2698 11.1184 13.4845 9.36686 11.3016C8.74685 12.3803 8.42104 13.6064 8.42278 14.8545C8.42278 17.3042 9.65375 19.4684 11.5252 20.7355C10.4177 20.7002 9.33455 20.3973 8.36607 19.8519V19.9398C8.36641 21.5713 8.92379 23.1525 9.94372 24.4152C10.9637 25.678 12.3834 26.5446 13.9621 26.8682C12.934 27.1504 11.856 27.192 10.8097 26.9899C11.2548 28.3942 12.1224 29.6224 13.2909 30.5024C14.4595 31.3825 15.8705 31.8703 17.3264 31.8977C15.8794 33.0488 14.2226 33.8997 12.4507 34.4018C10.6789 34.9038 8.82665 35.0473 7 34.8238C10.1887 36.9009 13.9006 38.0036 17.6917 38C30.5234 38 37.5406 27.2331 37.5406 17.8956C37.5406 17.5915 37.5323 17.284 37.5189 16.9833C38.8848 15.9834 40.0636 14.7448 41 13.3256L40.9983 13.3239Z" fill="var(--color-text)" />
                            </svg>
                        }
                        link='https://twitter.com/eco'>
                        Следи за нами на Twitter, чтобы быть в курсе самых актуальных новостей и событий. Наши твиты предоставляют обновления о наших продуктах, партнерствах, событиях и других интересных сведениях.
                    </JoinItem>

                    <JoinItem
                        title='Telegram'
                        image={
                            <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0_4939_869)">
                                    <path d="M24 41C14.6109 41 7 33.3891 7 24C7 14.6109 14.6109 7 24 7C33.3891 7 41 14.6109 41 24C41 33.3891 33.3891 41 24 41ZM18.713 25.989L18.7351 25.9771L20.2141 30.8561C20.4045 31.3848 20.6663 31.48 20.9842 31.4358C21.3038 31.3933 21.4721 31.2216 21.6812 31.021L23.7008 29.0694L28.0358 32.279C28.828 32.7159 29.3975 32.4898 29.5947 31.5446L32.4116 18.2472C32.7227 17.0096 32.1787 16.5132 31.2182 16.9076L14.6721 23.2996C13.5433 23.7518 13.5501 24.3842 14.4681 24.6647L18.713 25.989Z" fill="var(--color-text)" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_4939_869">
                                        <rect width="48" height="48" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>

                        }
                        link='https://t.me/eco_announcements'>
                        Здесь мы сообщаем о запуске новых продуктов, предстоящих событиях, обновлениях и других ключевых информациях.
                    </JoinItem>
                </ul>
            </div>
        </section>
    )
}
